Core/src/src/Catalogs/AzRyКонтрагентОрганизации/AzRyКонтрагентОрганизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>AzRyКонтрагентОрганизации</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
</mdclass:Catalog>

Core/src/src/Catalogs/AzRyНастройкаРЛС/AzRyНастройкаРЛС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>AzRyНастройкаРЛС</name>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОграниченияПоОрганизациям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОграниченияПоКонтрагентам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОграниченияПоПодразделениям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОграниченияПоПроектам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОграниченияПоСтруктурныеЕдиницам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОграниченияПоБанковскимСчетам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Организации</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Контрагенты</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Подразделения</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Проекты</name>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтруктурныеЕдиницы</name>
    <attributes>
      <name>СтруктурныеЕдиница</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>БанковскиеСчета</name>
    <attributes>
      <name>СчетБанка</name>
      <type>
        <types>CatalogRef.БанковскиеСчета</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/src/Catalogs/AzRyКонтрагентОрганизации/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОрганизацияПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	НовоеНаим = Строка(Объект.Организация);
	//Если Объект.ЯвляетсяОсновной Тогда
	//	НовоеНаим = НовоеНаим + " (основная)";
	//КонецЕсли;
	Если Объект.Наименование <> НовоеНаим Тогда
		Объект.Наименование = НовоеНаим;
	//	Записать();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = ПолучитьДоступныеОрганизации();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДоступныеОрганизации()
	
	Ответ = Новый СписокЗначений;
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	AzRyНастройкаРЛСОрганизации.Организация КАК Организация
		|ИЗ
		|	Справочник.AzRyНастройкаРЛС.Организации КАК AzRyНастройкаРЛСОрганизации
		|ГДЕ
		|	НЕ AzRyНастройкаРЛСОрганизации.Ссылка.ПометкаУдаления
		|	И AzRyНастройкаРЛСОрганизации.Ссылка.Пользователь = &Пользователь";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
	
	Ответ.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Организация"));
	
	Возврат Ответ;
	
КонецФункции
